src/Documents/BankReconciliation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>BankReconciliation</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CashFlowData</xr:Item>
				<xr:Item>AccumulationRegister.BankReconciliation</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>BankAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BeginningBalance</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ClearedAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ClearedBalance</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Difference</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EndingBalance</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>payments</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deposits</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LineItems</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Transaction</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.BankTransfer</v8:Type>
								<v8:Type>cfg:DocumentRef.GeneralJournalEntry</v8:Type>
								<v8:Type>cfg:DocumentRef.Deposit</v8:Type>
								<v8:Type>cfg:DocumentRef.CashSale</v8:Type>
								<v8:Type>cfg:DocumentRef.Check</v8:Type>
								<v8:Type>cfg:DocumentRef.CashReceipt</v8:Type>
								<v8:Type>cfg:DocumentRef.InvoicePayment</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TransactionAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Cleared</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/BankReconciliation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<AccumulationRegister>
		<Properties>
			<Name>BankReconciliation</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Document</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.BankTransfer</v8:Type>
						<v8:Type>cfg:DocumentRef.Deposit</v8:Type>
						<v8:Type>cfg:DocumentRef.CashSale</v8:Type>
						<v8:Type>cfg:DocumentRef.Check</v8:Type>
						<v8:Type>cfg:DocumentRef.CashReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.InvoicePayment</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/BankTransactions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>BankTransactions</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Category</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Document</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.BankTransfer</v8:Type>
						<v8:Type>cfg:DocumentRef.GeneralJournalEntry</v8:Type>
						<v8:Type>cfg:DocumentRef.Deposit</v8:Type>
						<v8:Type>cfg:DocumentRef.Check</v8:Type>
						<v8:Type>cfg:DocumentRef.PurchaseInvoice</v8:Type>
						<v8:Type>cfg:DocumentRef.CashReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.InvoicePayment</v8:Type>
						<v8:Type>cfg:DocumentRef.SalesInvoice</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Accepted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Hidden</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>OriginalID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>YodleeTransactionID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Class</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Classes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Project</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Projects</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CheckNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>PostDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Quantity</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RunningBalance</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrencyCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CategoryID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Comment>Credit/Debit</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CategorizedCompanyNotAccepted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CategorizedCategoryNotAccepted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OrderID</Name>
					<Comment>Sorts transactions within a day</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Imported</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>TransactionDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>BankAccount</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BankAccounts</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/BankReconciliation/Ext/ManagerModule.bsl
//Printing Reconciliation report
// Result - spreadsheet document
// Comand parameter array, 0 item has to be DocumentRef.BankReconciliation
Procedure PrintReconciliationReport(Result, CommandParameter) Export 
	
	Query = New Query("SELECT
	|	BankReconciliationLineItems.Transaction,
	|	BankReconciliationLineItems.TransactionAmount,
	|	BankReconciliationLineItems.Cleared
	|INTO TabularSection
	|FROM
	|	Document.BankReconciliation.LineItems AS BankReconciliationLineItems
	|WHERE
	|	BankReconciliationLineItems.Ref = &Ref
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	TransactionsForReconciliation.Ref,
	|	TransactionsForReconciliation.Date,
	|	TransactionsForReconciliation.Company,
	|	TransactionsForReconciliation.Number,
	|	SUM(TransactionsForReconciliation.Amount) AS Amount,
	|	TransactionsForReconciliation.Cleared AS Cleared
	|INTO UnreconciledTransactions
	|FROM
	|	(SELECT
	|		BankReconciliationBalance.Document AS Ref,
	|		BankReconciliationBalance.Document.Date AS Date,
	|		BankReconciliationBalance.Document.Company AS Company,
	|		BankReconciliationBalance.Document.Number AS Number,
	|		BankReconciliationBalance.AmountBalance AS Amount,
	|		FALSE AS Cleared
	|	FROM
	|		AccumulationRegister.BankReconciliation.Balance(&BoundaryEndOfStatementDate, Account = &BankAccount) AS BankReconciliationBalance
	|	WHERE
	|		BankReconciliationBalance.Document.Date <= &EndOfStatementDate
	|	
	|	UNION ALL
	|	
	|	
	|	SELECT
	|		BankReconciliation.Document,
	|		BankReconciliation.Document.Date,
	|		BankReconciliation.Document.Company,
	|		BankReconciliation.Document.Number,
	|		BankReconciliation.Amount,
	|		TRUE
	|	FROM
	|		AccumulationRegister.BankReconciliation AS BankReconciliation
	|	WHERE
	|		BankReconciliation.Recorder = &ThisDocument
	|		AND BankReconciliation.Active = TRUE) AS TransactionsForReconciliation
	|
	|GROUP BY
	|	TransactionsForReconciliation.Ref,
	|	TransactionsForReconciliation.Date,
	|	TransactionsForReconciliation.Company,
	|	TransactionsForReconciliation.Number,
	|	TransactionsForReconciliation.Cleared
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	AllTransactions.Transaction,
	|	AllTransactions.DocType,
	|	AllTransactions.Date,
	|	AllTransactions.Company,
	|	AllTransactions.DocNumber,
	|	AllTransactions.TransactionAmount As Amount,
	|	AllTransactions.Cleared,
	|	AllTransactions.GroupLabel,
	|	AllTransactions.BankTransactionDate,
	|	AllTransactions.BankTransactionDescription,
	|	AllTransactions.BankTransactionAmount,
	|	AllTransactions.BankTransactionCategory
	|FROM
	|(SELECT
	|	VALUETYPE(UnreconciledTransactions.Ref) AS DocType,
	|	UnreconciledTransactions.Ref AS Transaction,
	|	UnreconciledTransactions.Date,
	|	UnreconciledTransactions.Company,
	|	UnreconciledTransactions.Number AS DocNumber,
	|	UnreconciledTransactions.Amount AS TransactionAmount,
	|	UnreconciledTransactions.Cleared AS Cleared,
	|	CASE
	|		WHEN (UnreconciledTransactions.Amount < 0) AND UnreconciledTransactions.Cleared 
	|			THEN 1
	|		WHEN (UnreconciledTransactions.Amount > 0) AND UnreconciledTransactions.Cleared 
	|			THEN 2
	|		WHEN (UnreconciledTransactions.Amount < 0) AND (NOT UnreconciledTransactions.Cleared) 
	|			THEN 3
	|		WHEN (UnreconciledTransactions.Amount > 0) AND (NOT UnreconciledTransactions.Cleared)
	|			THEN 4
	|		ELSE 9
	|	END AS GroupLabel,
	|	ISNULL(BankTransactions.TransactionDate, DATETIME(1, 1, 1)) AS BankTransactionDate,
	|	ISNULL(BankTransactions.Description, """") AS BankTransactionDescription,
	|	ISNULL(BankTransactions.Amount, 0) AS BankTransactionAmount,
	|	ISNULL(BankTransactions.Category, VALUE(Catalog.BankTransactionCategories.EmptyRef)) AS BankTransactionCategory
	|FROM
	|	UnreconciledTransactions AS UnreconciledTransactions
	|		LEFT JOIN InformationRegister.BankTransactions AS BankTransactions
	|		ON UnreconciledTransactions.Ref = BankTransactions.Document
	|			AND (BankTransactions.BankAccount.AccountingAccount = &BankAccount)
	|			 )AS AllTransactions
	|
	|ORDER BY
	|	AllTransactions.GroupLabel, AllTransactions.Date
	|	TOTALS SUM(Amount) BY AllTransactions.GroupLabel
	|	");
	
	Doc = CommandParameter[0].Ref;
	Query.SetParameter("Ref",Doc);
	Query.SetParameter("BoundaryEndOfStatementDate", New Boundary(EndOfDay(Doc.Date), BoundaryType.Including));
	Query.SetParameter("BoundaryEndOfStatementDateExcluded", New Boundary(EndOfDay(Doc.Date), BoundaryType.Excluding));
	Query.SetParameter("EndOfStatementDate", EndOfDay(Doc.Date));
	Query.SetParameter("BankAccount", Doc.BankAccount);
	Query.SetParameter("ThisDocument", Doc.Ref);
	
	QResult = Query.Execute().Unload(QueryResultIteration.ByGroups);	
	
    Template = GetTemplate("ReconciliationReport"); 
	
	Header = Template.GetArea("Header");
	CnPClearedHeader = Template.GetArea("CnPClearedHeader");
	DnCrClearedHeader = Template.GetArea("DnCrClearedHeader");
	CnPUnclearedHeaderOn = Template.GetArea("CnPUnclearedHeaderOn");
	DnCrUnclearedHeaderOn = Template.GetArea("DnCrUnclearedHeaderOn");
	
	DetailHeader = Template.GetArea("DetailHeader");
	DetailString = Template.GetArea("DetailString");
	DetailTotal = Template.GetArea("Total");
	UnclearedBefore = 0;
	BalanceBefore = 0;
	UnclearedAfter = 0;
	BalanceAfter = 0;
	CheckAndPayments = 0;
	DepositsAndCredits = 0;
	For Each TabRow In QResult.Rows Do 
		If TabRow.GroupLabel = 1 Then 
			CheckAndPayments = TabRow.Amount;
		ElsIf TabRow.GroupLabel = 2 Then 
			DepositsAndCredits = TabRow.Amount;
		ElsIf TabRow.GroupLabel = 3 Then 
			UnclearedBefore = UnclearedBefore + TabRow.Amount;
		ElsIf TabRow.GroupLabel = 4 Then 	
			UnclearedBefore = UnclearedBefore + TabRow.Amount;
		EndIf;
	EndDo;	
	
	Header.Parameters.CompanyName = Constants.SystemTitle.Get();
	Header.Parameters.AccountName = Doc.BankAccount;
	Header.Parameters.Date = Format(Doc.Date, "DF=MM/dd/yyyy");
	Header.Parameters.BeginBalance = Format(Doc.BeginningBalance, "NFD=2; NZ=0");
	Header.Parameters.EndingBalance = Format(Doc.EndingBalance, "NFD=2; NZ=0");
	Header.Parameters.CheckAndPayments =CheckAndPayments;
	Header.Parameters.DepositsAndCredits = DepositsAndCredits;
	Header.Parameters.UnclearedBefore = UnclearedBefore;
	
	Result.Join(Header);	
	For Each TabRow In QResult.Rows Do 
		If TabRow.GroupLabel = 1 Then 
			Result.Join(CnPClearedHeader);
		ElsIf TabRow.GroupLabel = 2 Then 
			Result.Join(DnCrClearedHeader);
		ElsIf TabRow.GroupLabel = 3 Then 
			CnPUnclearedHeaderOn.Parameters.date = Format(Doc.Date, "DF=MM/dd/yyyy");
			Result.Join(CnPUnclearedHeaderOn);
		ElsIf TabRow.GroupLabel = 4 Then 	
			DnCrUnclearedHeaderOn.Parameters.date = Format(Doc.Date, "DF=MM/dd/yyyy");
			Result.Join(DnCrUnclearedHeaderOn);
		Else
			
		EndIf;	
		Result.Join(DetailHeader);
		For Each DetailRow in TabRow.Rows Do 
			DetailString.Parameters.DateDoc = Format(DetailRow.Date, "DF=MM/dd/yyyy"); 
			DetailString.Parameters.Type = DetailRow.DocType;
			DetailString.Parameters.Num = DetailRow.DocNumber;
			DetailString.Parameters.Name = DetailRow.Company;
			DetailString.Parameters.Sum = DetailRow.Amount;
			Result.Join(DetailString);
		EndDo;
		DetailTotal.Parameters.sum = TabRow.Amount;
		Result.Join(DetailTotal);
	EndDo;	
	
EndProcedure
